time 93
work 71
class 54
lectur 51
materi 51
pace 51
like 35
live 33
easier 29
allow 25
learn 25
prefer 24
onlin 23
get 22
inform 22
also 21
go 21
find 20
note 20
studi 20
zoom 20
feel 19
video 19
abl 18
access 18
it’ 18
take 18
want 18
need 17
read 17
better 16
much 16
record 16
make 15
understand 15
upload 15
without 15
im 14
listen 14
use 14
call 13
email 13
internet 13
hard 12
rather 12
schedul 12
thing 12
back 11
cours 11
focu 11
look 11
question 11
content 10
flexibl 10
help 10
meet 10
way 10
whenev 10
best 9
complet 9
dont 9
freedom 9
i’m 9
independ 9
teach 9
concentr 8
connect 8
day 8
don’t 8
done 8
easi 8
even 8
often 8
would 8
anxieti 7
ask 7
assign 7
discuss 7
follow 7
learner 7
mode 7
peopl 7
pressur 7
specif 7
visual 7
actual 6
alway 6
due 6
easili 6
give 6
home 6
instead 6
issu 6
less 6
one 6
practic 6
professor 6
quit 6
rush 6
student 6
written 6
check 5
come 5
engag 5
everyth 5
free 5
hour 5
i’d 5
keep 5
lot 5
miss 5
organ 5
person 5
possibl 5
research 5
set 5
sometim 5
speak 5
stress 5
task 5
teacher 5
tri 5
us 5
watch 5
write 5
anytim 4
attent 4
audio 4
concept 4
decid 4
digest 4
distract 4
everyon 4
faster 4
fit 4
form 4
forum 4
good 4
includ 4
lack 4
long 4
made 4
mean 4
new 4
option 4
organis 4
paus 4
pay 4
powerpoint 4
provid 4
realli 4
uncomfort 4
uni 4
absorb 3
activ 3
along 3
anyway 3
around 3
case 3
choos 3
difficult 3
direct 3
download 3
effici 3
especi 3
etc 3
exampl 3
exhaust 3
extra 3
first 3
found 3
given 3
harder 3
import 3
join 3
mani 3
met 3
mostli 3
normal 3
part 3
phone 3
plan 3
plu 3
poor 3
put 3
resourc 3
see 3
self 3
seminar 3
send 3
slow 3
someon 3
someth 3
spend 3
struggl 3
there 3
think 3
timet 3
wast 3
week 3
10 2
abil 2
affect 2
afterward 2
almost 2
alon 2
alreadi 2
annoy 2
anxiou 2
anywher 2
assum 2
attend 2
avail 2
bad 2
badli 2
bit 2
break 2
can’t 2
cant 2
caus 2
chanc 2
chang 2
chat 2
choic 2
classroom 2
clear 2
constantli 2
contribut 2
conveni 2
correct 2
could’v 2
couldn’t 2
covid 2
current 2
degre 2
depend 2
detail 2
didn’t 2
effect 2
eg 2
enough 2
ever 2
explain 2
fact 2
fast 2
feedback 2
fix 2
front 2
full 2
glanc 2
googl 2
got 2
happen 2
howev 2
ie 2
info 2
instruct 2
instructor 2
interact 2
isn’t 2
key 2
know 2
knowledg 2
later 2
lockdown 2
log 2
lose 2
love 2
manag 2
method 2
minut 2
modul 2
offer 2
offlin 2
order 2
other 2
particip 2
prepar 2
print 2
quickli 2
rang 2
refer 2
requir 2
restrict 2
rewind 2
room 2
said 2
say 2
screen 2
sens 2
show 2
sibl 2
similar 2
simpl 2
simpli 2
sinc 2
sit 2
situat 2
skill 2
space 2
speed 2
still 2
stop 2
straight 2
structur 2
subject 2
suitabl 2
sure 2
talk 2
tech 2
technolog 2
term 2
told 2
translat 2
trust 2
unlik 2
useless 2
via 2
view 2
wait 2
well 2
whilst 2
wors 2
year 2
younger 2
“in 1
14 1
1hour 1
2 1
2015 1
5min 1
8 1
90 1
9h 1
academ 1
accumul 1
act 1
actor 1
adapt 1
add 1
addit 1
adhd 1
adjust 1
advanc 1
ahead 1
alwayd 1
among 1
answer 1
anymor 1
aren’t 1
art 1
assing 1
asynchron 1
attach 1
auditori 1
away 1
awkward 1
awkwardli 1
bare 1
base 1
bave 1
behind 1
believ 1
board 1
bolton 1
book 1
bore 1
bovt 1
brain 1
build 1
busi 1
camera 1
cancel 1
cannot 1
care 1
catch 1
certain 1
citi 1
clariti 1
class” 1
classesdiscuss 1
classsess 1
closer 1
colleg 1
comfort 1
compar 1
compil 1
confer 1
conform 1
conjunct 1
constant 1
constraint 1
consult 1
contain 1
context 1
continu 1
control 1
convieni 1
convini 1
could 1
couldnt 1
courseslectur 1
date 1
deadlin 1
deaf 1
deal 1
dealt 1
definit 1
deliv 1
depeer 1
depth 1
design 1
despit 1
devic 1
dictat 1
differ 1
difficulti 1
dificulti 1
dip 1
directli 1
disciplin 1
discussionsdeb 1
distractionsmak 1
document 1
doesn’t 1
doesnt 1
doubt 1
dread 1
dri 1
easiest 1
element 1
end 1
engin 1
enjoy 1
environ 1
environment 1
essayspap 1
essenti 1
everi 1
everyone’ 1
everytth 1
exam 1
excpect 1
experi 1
face 1
famili 1
feasibl 1
fee 1
felt 1
field 1
file 1
fill 1
five 1
flow 1
focus 1
folder 1
forc 1
fore 1
formal 1
forth 1
fot 1
foward 1
frame 1
freak 1
freez 1
friend 1
frustrat 1
fulli 1
futur 1
gener 1
goe 1
grasp 1
group 1
habit 1
hadn’t 1
hate 1
health 1
hear 1
heavi 1
highlight 1
histori 1
homework 1
honestli 1
i’v 1
id 1
ideal 1
imposs 1
improv 1
individu 1
induc 1
intens 1
interest 1
intimid 1
ive 1
jave 1
job 1
kept 1
kind 1
kinda 1
lab 1
lag 1
laptop 1
laptopinternet 1
larger 1
last 1
lead 1
least 1
lecturesb 1
let 1
life 1
link 1
littl 1
lost 1
major 1
mandatori 1
map 1
meant 1
mental 1
messag 1
mic 1
might 1
mind 1
minim 1
mix 1
mixtur 1
moment 1
motiv 1
music 1
neccesari 1
nervewrack 1
nervou 1
never 1
nice 1
nois 1
non 1
number 1
obtain 1
occasion 1
od 1
onlinel 1
onlinerecord 1
opporun 1
oppos 1
origin 1
otherwis 1
overal 1
pack 1
page 1
paper 1
parent 1
particular 1
pase 1
passiv 1
past 1
patchi 1
pdf 1
peer 1
pen 1
perhap 1
pf 1
pj 1
platform 1
pleas 1
podcast 1
post 1
problem 1
product 1
prof 1
program 1
progress 1
project 1
projectassing 1
qualiti 1
quiet 1
reaccess 1
readi 1
real 1
reason 1
receiv 1
reciev 1
recordingm 1
refresh 1
regardless 1
relax 1
relev 1
relevantmotiv 1
reli 1
rememb 1
remov 1
restart 1
restraint 1
retain 1
review 1
revis 1
revisit 1
rewatch 1
routin 1
save 1
school 1
schoolwork 1
script 1
scroll 1
second 1
section 1
seem 1
selfmotiv 1
selfstudi 1
seminarsclass 1
sensit 1
sent 1
session 1
sever 1
share 1
shi 1
shift 1
shove 1
silenc 1
site 1
skip 1
slay 1
slide 1
slidesinform 1
slot 1
slower 1
softwar 1
somehow 1
speech 1
stay 1
step 1
stick 1
straightforward 1
stretch 1
strict 1
strong 1
studiosworkshop 1
stuff 1
style 1
submit 1
subtitl 1
supplementari 1
support 1
suppos 1
system 1
tend 1
test 1
that’ 1
theori 1
there’ 1
they’r 1
though 1
throughout 1
timei 1
tire 1
tone 1
topic 1
track 1
train 1
transcript 1
transfer 1
tuition 1
turn 1
tutor 1
two 1
type 1
ungrad 1
unintent 1
univers 1
universitylectur 1
unlimit 1
unmotiv 1
unnecessari 1
unprofession 1
unstabl 1
usual 1
vagu 1
valu 1
voic 1
weekli 1
werent 1
what’ 1
whatev 1
whem 1
wheni 1
wherea 1
whole 1
wider 1
wish 1
workbook 1
worker 1
worklif 1
workload 1
wrap 1
wrong 1
ye 1
zone 1
