time 302
onlin 279
class 185
work 151
lectur 142
cours 129
like 116
feel 115
prefer 101
learn 100
get 92
person 90
home 84
pace 79
less 77
studi 77
also 73
better 71
much 71
go 68
take 63
inperson 58
easier 57
comfort 56
abl 54
dont 53
uni 53
would 53
day 52
don’t 52
flexibl 51
hour 51
make 51
way 51
want 49
commut 45
i’m 45
peopl 45
engag 44
travel 43
need 42
thing 42
allow 40
it’ 39
anxieti 38
distract 38
question 36
univers 35
im 34
live 34
lot 34
schedul 34
social 34
give 33
record 33
use 32
wast 31
miss 30
motiv 30
student 30
freedom 29
interact 29
realli 29
save 29
ask 28
find 28
materi 27
attend 26
manag 26
watch 25
enjoy 24
one 24
sinc 24
spend 24
think 24
howev 23
rather 23
school 23
stress 22
help 21
back 20
focu 20
friend 20
product 20
understand 20
best 19
actual 18
etc 18
environ 17
place 17
pressur 17
space 17
still 17
well 17
assign 16
note 16
paus 16
sometim 16
complet 15
concentr 15
could 15
good 15
suit 15
teacher 15
whenev 15
conveni 14
even 14
move 14
often 14
particip 14
professor 14
see 14
someth 14
stay 14
struggl 14
talk 14
2 13
abil 13
activ 13
answer 13
choos 13
done 13
famili 13
focus 13
follow 13
group 13
instead 13
love 13
possibl 13
teach 13
content 12
control 12
differ 12
far 12
inform 12
introvert 12
keep 12
life 12
meet 12
read 12
us 12
around 11
effici 11
everyth 11
independ 11
option 11
organis 11
room 11
structur 11
without 11
zoom 11
bit 10
campu 10
classmat 10
colleg 10
due 10
free 10
health 10
know 10
lesson 10
mani 10
mean 10
mental 10
opportun 10
plan 10
relax 10
set 10
speed 10
subject 10
though 10
transport 10
usual 10
video 10
access 9
aspect 9
break 9
chat 9
come 9
confid 9
contact 9
difficult 9
easili 9
everyday 9
i’v 9
instructor 9
listen 9
organ 9
reason 9
rewatch 9
stuff 9
term 9
topic 9
week 9
wherea 9
although 8
anxiou 8
away 8
benefit 8
current 8
deal 8
degre 8
discuss 8
earli 8
eg 8
everi 8
experi 8
fast 8
normal 8
part 8
practic 8
present 8
speak 8
start 8
tutori 8
worri 8
amount 7
attent 7
bore 7
can’t 7
certain 7
classroom 7
easi 7
educ 7
ever 7
fact 7
found 7
hard 7
level 7
librari 7
littl 7
new 7
prepar 7
put 7
say 7
self 7
session 7
sleep 7
technolog 7
u 7
wake 7
3 6
alway 6
bad 6
base 6
bu 6
chanc 6
chang 6
drive 6
effect 6
email 6
energi 6
especi 6
extra 6
face 6
harder 6
high 6
huge 6
id 6
learner 6
least 6
long 6
made 6
nice 6
outsid 6
pay 6
properli 6
shi 6
therefor 6
timet 6
two 6
upload 6
write 6
year 6
almost 5
anywher 5
avail 5
awkward 5
behind 5
case 5
commun 5
compar 5
contribut 5
creativ 5
disciplin 5
effort 5
end 5
exam 5
first 5
fit 5
fulli 5
grade 5
hand 5
ideal 5
ill 5
isnt 5
ive 5
kind 5
lab 5
larg 5
locat 5
look 5
other 5
overwhelm 5
physic 5
point 5
process 5
qualiti 5
quit 5
requir 5
right 5
said 5
seem 5
seminar 5
sit 5
there’ 5
tire 5
wait 5
whilst 5
1 4
4 4
7 4
alon 4
arrang 4
balanc 4
believ 4
benefici 4
cant 4
citi 4
collabor 4
comput 4
consid 4
consum 4
countri 4
crowd 4
decid 4
depend 4
desk 4
didn’t 4
disabl 4
eat 4
either 4
everyon 4
explan 4
faster 4
full 4
got 4
hall 4
hobbi 4
i’d 4
idea 4
import 4
individu 4
involv 4
leav 4
loos 4
medicin 4
method 4
mixtur 4
moment 4
mood 4
morn 4
mostli 4
next 4
order 4
peer 4
powerpoint 4
pre 4
problem 4
provid 4
public 4
reach 4
rush 4
small 4
smaller 4
somehow 4
spent 4
suffer 4
that 4
thought 4
train 4
tri 4
wherev 4
absolut 3
adapt 3
adjust 3
advanc 3
advantag 3
alongsid 3
alreadi 3
anyth 3
bodi 3
build 3
call 3
calm 3
care 3
catch 3
caus 3
challeng 3
clean 3
close 3
club 3
comparison 3
connect 3
continu 3
cook 3
cost 3
covid 3
creat 3
daili 3
despit 3
disadvantag 3
dislik 3
dorm 3
doubl 3
eas 3
encourag 3
enough 3
event 3
exhaust 3
expens 3
facil 3
fall 3
felt 3
final 3
finish 3
forum 3
foster 3
freeli 3
futur 3
given 3
global 3
great 3
guess 3
half 3
happen 3
homework 3
honestli 3
hous 3
improv 3
interest 3
intimid 3
isn’t 3
issu 3
lack 3
later 3
lol 3
lose 3
loud 3
major 3
matter 3
may 3
mayb 3
met 3
minerva 3
money 3
moreov 3
natur 3
necessari 3
nois 3
offic 3
onlineclass 3
overal 3
pick 3
post 3
previous 3
project 3
proper 3
receiv 3
reduc 3
repeat 3
research 3
resourc 3
revis 3
routin 3
run 3
screen 3
sens 3
sever 3
share 3
show 3
side 3
situat 3
skill 3
skip 3
someon 3
stop 3
straight 3
style 3
surround 3
task 3
taught 3
tend 3
that’ 3
they’r 3
theyr 3
three 3
thu 3
tough 3
track 3
traffic 3
via 3
wasn’t 3
wear 3
went 3
whole 3
world 3
‘in 2
100 2
11 2
12 2
5 2
absorb 2
accord 2
account 2
across 2
addit 2
afraid 2
aliv 2
anonym 2
anoth 2
anyway 2
appli 2
aris 2
background 2
bare 2
basi 2
becom 2
bed 2
big 2
box 2
bring 2
busi 2
cannot 2
car 2
charg 2
cheaper 2
choic 2
chose 2
circumst 2
clarif 2
cloth 2
coffe 2
collag 2
combin 2
comment 2
con 2
concept 2
confort 2
constantli 2
constrain 2
count 2
cut 2
daunt 2
decis 2
deeper 2
definit 2
design 2
develop 2
directli 2
doesnt 2
downsid 2
draw 2
drawback 2
drink 2
embarrass 2
enabl 2
equat 2
equip 2
establish 2
experienc 2
explain 2
extrem 2
factor 2
field 2
financi 2
flashcard 2
forc 2
form 2
format 2
franc 2
fun 2
furthermor 2
gave 2
german 2
googl 2
h 2
happi 2
happier 2
hate 2
haven’t 2
headphon 2
higher 2
hope 2
i‘m 2
influenc 2
info 2
input 2
internship 2
interrupt 2
irl 2
job 2
journey 2
knowledg 2
late 2
law 2
lazi 2
left 2
liter 2
longer 2
mate 2
memor 2
might 2
mind 2
minut 2
mode 2
month 2
multitask 2
mute 2
name 2
near 2
obvious 2
offer 2
okay 2
onlinelearn 2
open 2
opinion 2
optim 2
pain 2
panic 2
perfect 2
person’ 2
phone 2
plain 2
plu 2
potenti 2
prerecord 2
pretti 2
privaci 2
pro 2
probabl 2
purpos 2
pursu 2
quicker 2
quickli 2
real 2
reali 2
refer 2
regard 2
relationship 2
reliev 2
rememb 2
remot 2
respons 2
restrict 2
result 2
return 2
revisit 2
round 2
schedual 2
section 2
semest 2
slightli 2
slow 2
slower 2
sole 2
somebodi 2
special 2
stand 2
stare 2
state 2
suitabl 2
suppos 2
system 2
technic 2
test 2
text 2
theatr 2
theoret 2
there 2
third 2
threshold 2
thrive 2
togeth 2
top 2
tutor 2
unabl 2
unmotiv 2
w 2
walk 2
weird 2
wether 2
what’ 2
will 2
wise 2
workload 2
workout 2
workshop 2
wouldn’t 2
wouldnt 2
yet 2
you’r 2
your 2
zone 2
“seat” 1
“whenever” 1
„product 1
1015 1
130h 1
15 1
15h 1
1hr 1
1on1 1
200 1
25 1
30 1
36 1
45min 1
5050 1
6 1
700 1
8 1
89 1
9 1
9am 1
academia 1
acc 1
ad 1
add 1
afternoonnight 1
ago 1
ahead 1
aid 1
air 1
alloc 1
alltough 1
alot 1
aloud 1
amaz 1
among 1
amongst 1
amphitheath 1
analysi 1
andorra 1
anki 1
annoy 1
annoyin 1
anytim 1
applic 1
appreci 1
apprentic 1
apprenticeship 1
approach 1
appropri 1
area 1
argu 1
around5 1
arriv 1
art 1
asid 1
asleep 1
ass 1
assist 1
athlet 1
atmospher 1
attack 1
attacksfeel 1
auditorium 1
autumn 1
averag 1
awar 1
awesom 1
b 1
balconi 1
barcelona 1
barrier 1
bathroom 1
bc 1
beacus 1
bearabl 1
bedroom 1
beforehand 1
bigger 1
biggest 1
bill 1
blackboard 1
bless 1
blush 1
bombard 1
bond 1
bound 1
boyfriend 1
brainstorm 1
breakfast 1
breakout 1
brush 1
busier 1
buss 1
cafe 1
camera 1
cancel 1
capac 1
capit 1
casestudi 1
cater 1
celebr 1
cell 1
central 1
certainli 1
charact 1
charm 1
check 1
chemistri 1
chosen 1
chronic 1
chunk 1
cite 1
clase 1
classesthat 1
clear 1
clearer 1
clinic 1
closer 1
coach 1
colleagu 1
comfi 1
commit 1
common 1
compani 1
compass 1
compet 1
competit 1
comprehend 1
comprehens 1
condition 1
conduct 1
confus 1
connectionso 1
consciou 1
consist 1
constraint 1
construct 1
contrari 1
cool 1
correctli 1
couldn’t 1
couldnt 1
coursem 1
coursework 1
cous 1
cover 1
cozi 1
crisi 1
critic 1
crucial 1
cup 1
date 1
dayor 1
deadlin 1
debat 1
decreas 1
deepli 1
defin 1
deliv 1
deliveri 1
demand 1
depress 1
depth 1
derstand 1
detail 1
detriment 1
developp 1
devic 1
diagnos 1
digest 1
diploma 1
direct 1
disappear 1
discomfort 1
disconnect 1
disregard 1
distanc 1
ditch 1
dive 1
divid 1
doesn’t 1
doi 1
domin 1
dormroomm 1
downfal 1
dozen 1
drain 1
dress 1
dri 1
drove 1
dunno 1
duti 1
dynam 1
dyslex 1
earlier 1
eatsnack 1
edit 1
eeffort 1
efficientlywith 1
eith 1
electron 1
els 1
else’ 1
emphas 1
engin 1
ensur 1
entir 1
environment 1
erasmu 1
essay 1
essenti 1
everyone’ 1
everywher 1
exactli 1
exampl 1
exchang 1
excit 1
exclud 1
exclus 1
exist 1
expect 1
expos 1
express 1
extern 1
extracurricular 1
extrovert 1
facilit 1
fail 1
fan 1
fantast 1
fashion 1
fastforward 1
fear 1
feedback 1
fell 1
fellow 1
fewer 1
film 1
fine 1
fix 1
flat 1
flexibilti 1
food 1
foreign 1
forward 1
frank 1
french 1
friendlier 1
friendship 1
front 1
futurist 1
ga 1
gain 1
gap 1
garden 1
gather 1
gener 1
germani 1
glad 1
goahead 1
goe 1
gone 1
gossip 1
grant 1
grasp 1
greater 1
guidanc 1
guilti 1
gym 1
halfway 1
hang 1
havent 1
heart 1
heavi 1
heavili 1
hell 1
hide 1
hold 1
holiday 1
homebodi 1
homewhereverclassroom 1
howeverther 1
hug 1
human 1
hurdl 1
hybrid 1
i‘v 1
ie 1
ignor 1
implement 1
impos 1
imposs 1
includ 1
inclus 1
inconveni 1
increas 1
indirectli 1
ingag 1
initi 1
instantli 1
institut 1
instruct 1
integr 1
intend 1
intens 1
intercommun 1
intern 1
intrest 1
invest 1
investig 1
isol 1
it‘ 1
itali 1
jjst 1
judgement 1
juggl 1
laboratori 1
languag 1
laptop 1
larger 1
largescal 1
last 1
lastli 1
laundri 1
lay 1
lead 1
lecturer 1
lecutur 1
leisurepac 1
lession 1
let 1
library’ 1
lifestyl 1
line 1
listenattend 1
logist 1
london 1
loss 1
lost 1
lower 1
lug 1
main 1
maintain 1
mandatori 1
margin 1
massiv 1
math 1
meal 1
medit 1
memoris 1
mention 1
mess 1
messag 1
mic 1
microscop 1
mine 1
minim 1
mire 1
mistak 1
mix 1
mkre 1
mobil 1
modem 1
modern 1
modifi 1
modul 1
motion 1
movi 1
mutual 1
n 1
nap 1
nauseou 1
nearli 1
necessarili 1
neg 1
neither 1
nervou 1
neutral 1
never 1
nicer 1
nightmar 1
noisi 1
nonacadem 1
none 1
notebook 1
notesthought 1
noth 1
notic 1
notsoci 1
number 1
nurs 1
ny 1
obtain 1
odd 1
ok 1
old 1
oppos 1
opposit 1
oppurtun 1
optimum 1
oral 1
orlean 1
other’ 1
otherwis 1
paarent 1
pacefelt 1
paint 1
pandem 1
parent 1
park 1
particularli 1
pass 1
passion 1
passiv 1
past 1
pausetak 1
pdf 1
pe 1
peoplefeel 1
peoplemi 1
per 1
perform 1
perhap 1
phd 1
piec 1
pit 1
pj‘ 1
planet 1
platform 1
play 1
pleasant 1
pm 1
pool 1
poor 1
posit 1
postgradu 1
power 1
practica 1
practicestravel 1
pratic 1
precis 1
pressureconstraint 1
pressuresoci 1
pretend 1
prevent 1
previou 1
prework 1
primarili 1
prioriti 1
prioritis 1
proactiv 1
proctor 1
produc 1
prof 1
progress 1
promot 1
prove 1
provok 1
pure 1
pyjama 1
qa 1
quarantin 1
quiet 1
quizz 1
rang 1
rapport 1
rare 1
reaccess 1
react 1
readi 1
readingexercis 1
realis 1
reclarifi 1
recogn 1
recordedlectur 1
regret 1
reinforc 1
rel 1
relat 1
relaxt 1
relev 1
relisten 1
remotelearn 1
remov 1
rent 1
replay 1
resist 1
respond 1
resr 1
restetc 1
retail 1
review 1
rewind 1
rhong 1
rhythm 1
role 1
roommat 1
rude 1
sacrif 1
sadli 1
safe 1
safeti 1
sat 1
scare 1
scedul 1
scholar 1
schoollif 1
schoolwork 1
scienc 1
sciencerel 1
scientif 1
scope 1
seen 1
select 1
selfpac 1
send 1
separ 1
sequenc 1
short 1
shout 1
sibl 1
silli 1
site 1
situatiob 1
skillsbas 1
slack 1
slide 1
slight 1
smoother 1
smoothli 1
socialis 1
societ 1
softwar 1
solv 1
somewher 1
sommut 1
sooth 1
sorri 1
sorta 1
sound 1
spain 1
span 1
spare 1
spemd 1
spiritfor 1
split 1
sponten 1
st 1
stage 1
stair 1
standard 1
stead 1
stick 1
stilt 1
straightli 1
strategi 1
strength 1
strictli 1
stron 1
strong 1
stronger 1
stuck 1
stupid 1
submiss 1
subwaybu 1
suck 1
suddenli 1
super 1
support 1
sure 1
survey 1
sweat 1
switch 1
sync 1
ta 1
tackl 1
tailor 1
tasks“ 1
te 1
tea 1
teacher’ 1
techniqu 1
ted 1
tell 1
tendenc 1
th 1
theori 1
tho 1
throughout 1
thru 1
thw 1
tie 1
timeeffici 1
timeenergi 1
timemanag 1
timemoney 1
timepaus 1
timw 1
tiresom 1
told 1
ton 1
took 1
tool 1
toolbox 1
total 1
touch 1
transform 1
transit 1
travelcommut 1
travem 1
true 1
tuition 1
turn 1
type 1
ulp 1
underdevelop 1
underfund 1
undergradu 1
understood 1
undertak 1
unfortin 1
unfortun 1
unhelp 1
unicours 1
unnecessari 1
unnecessarili 1
unreason 1
unskil 1
unsur 1
useless 1
vídeo 1
valuabl 1
vari 1
veer 1
versu 1
view 1
viewpoint 1
violat 1
visit 1
voiceov 1
voluntarili 1
wall 1
wantne 1
wantwhen 1
we‘r 1
we’v 1
weak 1
weakli 1
web 1
webcam 1
what 1
whatev 1
whether 1
whic 1
whiteboard 1
wider 1
win 1
windowb 1
wont 1
word 1
workspac 1
wrote 1
yeah 1
yoga 1
