time 583
lectur 477
paus 275
watch 263
class 230
pace 217
go 207
live 206
record 202
back 176
understand 176
work 172
take 164
note 163
also 159
like 149
want 148
learn 141
abl 138
video 135
allow 129
need 122
whenev 116
easier 113
materi 113
make 98
zoom 91
someth 88
get 86
it’ 83
schedul 82
feel 81
better 80
flexibl 80
don’t 77
content 76
speed 75
access 73
miss 73
rewind 71
listen 70
rewatch 70
inform 69
question 68
give 64
onlin 63
studi 63
find 59
would 59
less 58
thing 56
much 54
prefer 54
explain 51
professor 51
way 51
dont 50
follow 50
student 50
help 48
conveni 47
discuss 47
i’m 47
realli 47
day 45
use 43
easi 42
replay 40
stop 40
still 39
part 38
pressur 37
ask 36
actual 35
alway 35
best 35
engag 35
good 35
write 35
etc 34
interact 34
internet 34
lot 34
mean 33
upload 33
anytim 32
connect 32
mani 32
person 32
think 32
detail 31
topic 31
well 31
without 31
call 29
choos 29
easili 29
one 29
read 29
attend 28
certain 28
complet 28
email 28
everyth 28
look 28
rather 28
suit 28
could 27
normal 27
similar 27
teach 27
abil 26
keep 26
home 25
manag 25
talk 25
anyth 24
cours 24
differ 24
lesson 24
difficult 23
hear 23
peopl 23
plan 23
point 23
session 23
sometim 23
teacher 23
anxieti 22
especi 22
specif 22
stress 22
break 21
distract 21
focu 21
hard 21
later 21
often 21
uni 21
us 21
concept 20
done 20
face 20
first 20
instead 20
meet 20
slow 20
univers 20
bit 19
didn’t 19
opportun 19
slide 19
awkward 18
didnt 18
fast 18
fulli 18
hour 18
see 18
sinc 18
concentr 17
given 17
option 17
usual 17
even 16
explan 16
fit 16
freedom 16
possibl 16
revis 16
seminar 16
struggl 16
zone 16
chat 15
come 15
forum 15
howev 15
import 15
info 15
may 15
method 15
particip 15
revisit 15
subject 15
avail 14
great 14
im 14
issu 14
moment 14
product 14
repeat 14
review 14
skip 14
sure 14
around 13
due 13
free 13
mode 13
play 13
powerpoint 13
process 13
provid 13
quit 13
set 13
catch 12
decid 12
effici 12
everyon 12
might 12
move 12
pre 12
prerecord 12
say 12
stuff 12
whatev 12
wifi 12
check 11
comfort 11
harder 11
know 11
necessari 11
refer 11
relisten 11
requir 11
seem 11
sit 11
someon 11
start 11
technic 11
tri 11
answer 10
anxiou 10
cant 10
caus 10
chang 10
compar 10
depend 10
doesnt 10
experi 10
lost 10
multipl 10
nice 10
organ 10
properli 10
speak 10
straight 10
structur 10
timet 10
view 10
worri 10
along 9
although 9
assign 9
attent 9
camera 9
contribut 9
fact 9
forget 9
full 9
group 9
ive 9
job 9
motiv 9
put 9
real 9
said 9
though 9
understood 9
year 9
adjust 8
aren’t 8
case 8
closest 8
combin 8
doesn’t 8
focus 8
forc 8
interrupt 8
join 8
lack 8
mental 8
oppos 8
poor 8
problem 8
receiv 8
research 8
section 8
spend 8
suitabl 8
tend 8
visual 8
voic 8
week 8
whilst 8
written 8
affect 7
board 7
chanc 7
classroom 7
contact 7
difficulti 7
doubt 7
easiest 7
enough 7
essenti 7
extra 7
faster 7
forward 7
grasp 7
instructor 7
plu 7
present 7
quickli 7
routin 7
save 7
taught 7
therefor 7
they’r 7
uncomfort 7
wherea 7
absorb 6
activ 6
ahead 6
alongsid 6
amount 6
anoth 6
anyway 6
arent 6
bad 6
clear 6
control 6
cover 6
creat 6
current 6
degre 6
effect 6
enabl 6
enjoy 6
happen 6
havent 6
i’v 6
idea 6
increas 6
isnt 6
least 6
leisur 6
level 6
life 6
limit 6
organis 6
particular 6
prof 6
resourc 6
second 6
sever 6
stay 6
term 6
thought 6
tutori 6
via 6
wast 6
whole 6
worker 6
1 5
add 5
audio 5
away 5
bc 5
book 5
classmat 5
commit 5
commun 5
data 5
depth 5
earli 5
famili 5
found 5
gain 5
inperson 5
languag 5
long 5
made 5
math 5
mayb 5
offer 5
physic 5
place 5
pleas 5
practic 5
quiet 5
reli 5
respons 5
retain 5
rhythm 5
right 5
small 5
technolog 5
tempo 5
thoroughli 5
unabl 5
unlik 5
your 5
2x 4
accommod 4
addit 4
afterward 4
alon 4
anyon 4
avoid 4
benefici 4
benefit 4
can’t 4
challeng 4
chose 4
clarif 4
clearli 4
comprehend 4
comprehens 4
conduct 4
confus 4
consult 4
couldnt 4
covid 4
daili 4
deliv 4
direct 4
directli 4
document 4
els 4
end 4
exam 4
facetofac 4
finish 4
frame 4
googl 4
hall 4
handi 4
health 4
honestli 4
hous 4
human 4
ideal 4
lag 4
last 4
let 4
love 4
morn 4
mostli 4
nois 4
opinion 4
order 4
other 4
overwhelm 4
pay 4
perfect 4
platform 4
proper 4
qualiti 4
reason 4
rush 4
situat 4
social 4
space 4
team 4
that 4
thu 4
tire 4
tutor 4
verbal 4
wake 4
wish 4
you’r 4
accord 3
across 3
adapt 3
alloc 3
almost 3
anonym 3
asynchron 3
basic 3
cannot 3
care 3
chaotic 3
chunk 3
circumst 3
clunki 3
collabor 3
comparison 3
concis 3
condit 3
contain 3
definit 3
delay 3
digest 3
disengag 3
disord 3
educ 3
element 3
ensur 3
entir 3
environ 3
ever 3
everi 3
exampl 3
experienc 3
extrem 3
far 3
format 3
freeli 3
gener 3
got 3
guess 3
half 3
hand 3
ie 3
independ 3
individu 3
input 3
interest 3
isn’t 3
kind 3
late 3
learner 3
learnt 3
lecturer’ 3
lecturesseminar 3
listenwatch 3
littl 3
longer 3
lose 3
low 3
major 3
microsoft 3
middl 3
minim 3
modul 3
mood 3
new 3
night 3
pandem 3
particularli 3
pauserewind 3
pauz 3
pdf 3
playback 3
post 3
previou 3
reflect 3
relat 3
relev 3
school 3
semest 3
shift 3
short 3
show 3
side 3
simpli 3
spot 3
stabl 3
stick 3
super 3
supplement 3
support 3
surround 3
tailor 3
there’ 3
timezon 3
tradit 3
twice 3
upslow 3
versu 3
what 3
won’t 3
wont 3
word 3
wouldn’t 3
yet 3
you’v 3
😂 2
15x 2
2 2
20 2
35 2
9am 2
acc 2
acceler 2
account 2
advantag 2
aid 2
alot 2
alreadi 2
andor 2
annoy 2
anymor 2
anywher 2
area 2
auditori 2
awak 2
base 2
beacus 2
becom 2
big 2
bore 2
bound 2
brain 2
busi 2
ca 2
capabl 2
clinic 2
close 2
closer 2
complic 2
comput 2
constantli 2
convers 2
convini 2
copi 2
coronaviru 2
cost 2
covid19 2
deep 2
deeper 2
demand 2
describ 2
design 2
desir 2
disabl 2
disadvantag 2
disregard 2
disrupt 2
doubl 2
drain 2
draw 2
dynam 2
eas 2
either 2
energi 2
english 2
essay 2
exercis 2
exhaust 2
expand 2
expect 2
faculti 2
familiar 2
feedback 2
fewer 2
final 2
flow 2
front 2
furthermor 2
futur 2
gave 2
hassl 2
haven’t 2
henc 2
high 2
higher 2
hit 2
i‘m 2
idk 2
ill 2
immedi 2
importantli 2
includ 2
ineffici 2
instruct 2
intens 2
interfer 2
intern 2
interpret 2
it‘ 2
key 2
kinda 2
knowledg 2
larg 2
lesser 2
load 2
lockdown 2
log 2
mail 2
main 2
mainli 2
maintain 2
mimic 2
mind 2
mindset 2
minut 2
mixtur 2
moreov 2
mute 2
network 2
never 2
nicer 2
number 2
oblig 2
obviou 2
obvious 2
occasion 2
offlin 2
old 2
one’ 2
onto 2
open 2
overal 2
pair 2
panic 2
paper 2
parttim 2
passiv 2
past 2
peac 2
per 2
pointless 2
ppt 2
prepar 2
pretti 2
primari 2
quarantin 2
quicker 2
quizz 2
readi 2
realist 2
regard 2
remain 2
rememb 2
remot 2
restrict 2
resum 2
return 2
risk 2
room 2
scatter 2
scream 2
screen 2
search 2
self 2
sens 2
share 2
shi 2
singl 2
slower 2
solv 2
somewhat 2
sort 2
sourc 2
standard 2
step 2
stuck 2
style 2
suffer 2
summari 2
supermarket 2
suppos 2
system 2
tediou 2
tell 2
text 2
theatr 2
there 2
thorough 2
thousand 2
time’ 2
togeth 2
took 2
tool 2
train 2
two 2
type 2
u 2
unclear 2
unstabl 2
useless 2
van 2
vid 2
wasnt 2
watchrewatch 2
we’v 2
weird 2
whether 2
workgroup 2
workshop 2
zoomonlin 2
‘access’ 1
‘live’ 1
‘phone 1
“hide” 1
“live 1
“passive” 1
“stop” 1
“take 1
“the 1
🥺 1
11 1
13 1
150 1
23 1
24 1
250 1
2h 1
3 1
30 1
40 1
7 1
700 1
730 1
8am 1
absolut 1
acca 1
accept 1
acces 1
accesswork 1
accident 1
accordingli 1
accur 1
acess 1
acord 1
ad 1
address 1
adequ 1
adhd 1
adher 1
administr 1
adob 1
afford 1
againon 1
ai 1
aittl 1
aliv 1
alter 1
amaz 1
ambigu 1
amor 1
analys 1
analyz 1
anim 1
annot 1
anxiety’ 1
anywhereanytim 1
appeal 1
appl 1
appli 1
applic 1
arrang 1
art 1
asleep 1
aspect 1
attain 1
attempt 1
audioaudio 1
aural 1
autom 1
availabilit 1
avl 1
aw 1
backrepeat 1
badli 1
ban 1
bard 1
barrabl 1
barrier 1
beacaus 1
becam 1
bed 1
begin 1
behest 1
behind 1
believ 1
beta 1
bing 1
biochemistri 1
biolog 1
biom 1
blackboard 1
blatant 1
block 1
blurri 1
bodi 1
bonu 1
bot 1
bother 1
bright 1
bring 1
broadband 1
brought 1
bufferingno 1
button 1
buy 1
calmli 1
cambridg 1
captur 1
cater 1
caught 1
center 1
chancemor 1
checkpoint 1
chem 1
chemist 1
choic 1
clarifi 1
classesdiscuss 1
classform 1
click 1
cohort 1
comment 1
compact 1
compani 1
compens 1
compet 1
complement 1
complex 1
concern 1
concret 1
confid 1
conflict 1
conjunct 1
connectionl 1
connexion 1
consentr 1
consept 1
consid 1
consider 1
consist 1
consolid 1
constant 1
constrict 1
consum 1
continu 1
conven 1
convient 1
convinc 1
cool 1
cope 1
correctli 1
counsellor 1
countri 1
crack 1
crate 1
crucial 1
crusti 1
cu 1
cue 1
cultur 1
dail 1
date 1
daterepeatpaus 1
daynight 1
decern 1
decis 1
dedic 1
deepli 1
deliveri 1
demonst 1
depen 1
desk 1
despit 1
dick 1
dictat 1
didn‘t 1
difficultiesoth 1
disciplin 1
discord 1
dissect 1
dissert 1
dk 1
docotor 1
doctor 1
doesn‘t 1
download 1
downsid 1
downspe 1
drift 1
drop 1
durat 1
duti 1
dyslex 1
e 1
echo 1
eg 1
ehich 1
eith 1
elimin 1
else’ 1
emailforum 1
emerg 1
employ 1
emul 1
encount 1
endless 1
engaginginterest 1
engang 1
enhanc 1
enviro 1
equal 1
error 1
everu 1
everyone’ 1
everytim 1
examplestri 1
examsdeadlin 1
exaust 1
except 1
expert 1
exploit 1
expos 1
extens 1
eye 1
facil 1
factor 1
family’ 1
fan 1
fastforward 1
favourit 1
felt 1
figur 1
film 1
financ 1
five 1
fix 1
flick 1
flip 1
focusconcentr 1
followaccess 1
forgot 1
form 1
formu 1
forth 1
foucues 1
foundat 1
friend 1
frontlin 1
fulltim 1
fun 1
function 1
gaug 1
germani 1
gettin 1
glitch 1
global 1
goe 1
gone 1
graduat 1
grant 1
greater 1
guarante 1
guid 1
guidanc 1
guilti 1
habit 1
handl 1
handout 1
hardest 1
hasnt 1
hate 1
head 1
heartedli 1
highli 1
histori 1
hobbi 1
hold 1
home” 1
homeworkstudi 1
honest 1
hospit 1
hr 1
huge 1
hunk 1
hustl 1
i’d 1
id 1
ii 1
immunolog 1
imperson 1
implement 1
importantmisunderstand 1
inact 1
inauthent 1
inclass 1
inclus 1
indepth 1
indian 1
induc 1
ineffect 1
inhibit 1
initi 1
insight 1
instructur 1
integr 1
intent 1
intepret 1
interactionlectur 1
interf 1
introvert 1
ipad 1
irl 1
isn‘t 1
isol 1
ist 1
itslow 1
jot 1
juggl 1
kan 1
kept 1
kid 1
knew 1
knowspe 1
lab 1
laid 1
laptop 1
larger 1
lastli 1
lazi 1
lead 1
learningfac 1
leav 1
lectureaudio 1
lectureclass 1
lecturesvideo 1
lecturevideo 1
lenienc 1
lession 1
lessoncont 1
line 1
listentak 1
liter 1
literatur 1
liverecord 1
lone 1
lool 1
loos 1
lse 1
luck 1
luckili 1
male 1
man 1
match 1
mathemat 1
matiri 1
matter 1
meaning 1
meant 1
memeor 1
mention 1
mere 1
mess 1
messag 1
messi 1
met 1
mic 1
might’v 1
minimis 1
mire 1
mishear 1
missedhelp 1
model 1
modifi 1
monologu 1
movi 1
neatli 1
necessarili 1
neededif 1
neg 1
nerv 1
nervewrack 1
nervou 1
next 1
nh 1
nobodi 1
nonverb 1
notesdo 1
notesget 1
notestak 1
notetak 1
offic 1
offici 1
om 1
ondin 1
optim 1
optimis 1
oral 1
orginz 1
otherhand 1
others’ 1
otherwis 1
outsid 1
overlap 1
overview 1
page 1
parent 1
pase 1
pass 1
passag 1
pauseabl 1
pausedo 1
pausedsp 1
pausego 1
pauseplay 1
pauserepeat 1
pauseskip 1
peer 1
pencil 1
peoplepeopl 1
perceiv 1
perk 1
perman 1
permit 1
personalis 1
perus 1
philippin 1
phobic 1
phone 1
phrase 1
physiolog 1
pick 1
placement 1
plain 1
podcast 1
polish 1
pop 1
portion 1
possibilti 1
potenti 1
powerpointlectur 1
powerpointsword 1
practis 1
prep 1
preparationread 1
presenc 1
press 1
pressuris 1
prevent 1
prework 1
primarili 1
principl 1
prior 1
prioriti 1
probabl 1
problema 1
procrastin 1
produc 1
productivegood 1
productuv 1
professor’ 1
professors’ 1
proffesor 1
program 1
progress 1
project 1
proof 1
pull 1
purpos 1
pursuit 1
qa 1
quantiti 1
questionsif 1
quiker 1
quot 1
rack 1
rang 1
rare 1
reaccess 1
reaction 1
readyso 1
realiti 1
reasearch 1
recap 1
recept 1
recheck 1
recommend 1
recordingvideo 1
recov 1
reduc 1
reexplain 1
refresh 1
relax 1
relearn 1
reliant 1
rematch 1
repeatedli 1
replac 1
repli 1
replic 1
resembl 1
rest 1
reupload 1
revers 1
rewarch 1
reward 1
rewatchexplor 1
rewindrewatch 1
rework 1
rich 1
rithm 1
role 1
round 1
rumbl 1
run 1
rythm 1
sametim 1
sat 1
scari 1
schedual 1
scheduletim 1
schoolwork 1
scienc 1
scroll 1
se 1
season 1
select 1
semblanc 1
seminarsclass 1
sent 1
seriou 1
shed 1
shorter 1
shouldnt 1
sibl 1
sign 1
significantli 1
silenc 1
simmilar 1
simpl 1
simultan 1
situación 1
size 1
skill 1
skim 1
sleep 1
slooow 1
slowli 1
sole 1
solid 1
solut 1
somehow 1
someone’a 1
somet 1
somewher 1
son 1
soooo 1
sound 1
spam 1
span 1
spars 1
special 1
sped 1
spent 1
spoke 1
spoken 1
springboard 1
statement 1
stimulu 1
strang 1
stream 1
strong 1
student’ 1
students’ 1
studentsmyself 1
studylearn 1
studyrevis 1
subsequ 1
subtitel 1
success 1
suddenli 1
suggest 1
summer 1
sunni 1
supervis 1
swing 1
symptom 1
synchron 1
taken 1
takin 1
tangent 1
target 1
task 1
teacer 1
tech 1
tendenc 1
textbook 1
textmateri 1
thar 1
that’ 1
thema 1
theme 1
thesi 1
theyr 1
third 1
tho 1
thrive 1
throughspe 1
throught 1
tie 1
time” 1
timecan 1
timelin 1
timepac 1
timescal 1
timewis 1
told 1
tone 1
topaus 1
total 1
tough 1
transcrib 1
transcript 1
transit 1
troubl 1
truli 1
trust 1
tuition 1
turn 1
tutornot 1
uk 1
uncertain 1
uncertainti 1
undergrad 1
underst 1
understandfind 1
unexpectedli 1
unexplain 1
unfair 1
unhelp 1
uni’ 1
uniwork 1
unlimit 1
unmotiv 1
unnatur 1
unsettl 1
uploadedemail 1
upon 1
upskip 1
ur 1
usag 1
utilis 1
utterli 1
vale 1
valuabl 1
videosrecord 1
videosslid 1
virtual 1
viru 1
visibl 1
visualauditori 1
visualssomeon 1
volunt 1
vs 1
wander 1
wasn’t 1
watchcomplet 1
watchlearn 1
watchlisten 1
watxh 1
weak 1
web 1
webcam 1
webcammicreli 1
webinar 1
went 1
weren’t 1
what’ 1
when 1
whenwher 1
wherev 1
who 1
wide 1
wind 1
wirh 1
wise 1
within 1
won‘t 1
wonder 1
wordswant 1
workingliv 1
worklectur 1
world 1
worlds” 1
wors 1
worth 1
worthi 1
would’v 1
writ 1
wrong 1
year’ 1
you‘r 1
youtub 1
youv 1
yt 1
zoomliv 1
zoomvirtu 1
