discuss 37
question 33
get 29
time 29
ask 25
interact 23
lectur 19
class 18
learn 18
abl 17
student 17
like 16
live 16
better 15
engag 15
feel 15
allow 14
peopl 14
understand 14
also 12
way 12
zoom 12
chat 11
make 11
easier 10
help 10
less 10
materi 10
particip 10
record 10
answer 9
inform 9
onlin 9
professor 9
think 9
work 9
idea 8
much 8
still 8
studi 8
without 8
activ 7
actual 7
call 7
find 7
knowledg 7
lot 7
opinion 7
other 7
peer 7
take 7
video 7
would 7
best 6
contribut 6
cours 6
everyon 6
give 6
listen 6
prefer 6
realli 6
speak 6
talk 6
use 6
anxieti 5
appli 5
back 5
board 5
classmat 5
face 5
feedback 5
forum 5
im 5
internet 5
it’ 5
someth 5
watch 5
attent 4
content 4
don’t 4
fellow 4
meet 4
person 4
read 4
respons 4
see 4
teacher 4
topic 4
us 4
whilst 4
write 4
access 3
background 3
bounc 3
chanc 3
commun 3
concept 3
connect 3
convers 3
differ 3
difficult 3
distract 3
doubt 3
easi 3
enjoy 3
even 3
first 3
go 3
good 3
hard 3
i’m 3
interest 3
intimid 3
know 3
leader 3
mani 3
mean 3
motiv 3
need 3
opportun 3
part 3
post 3
pressur 3
real 3
requir 3
seminar 3
sinc 3
sometim 3
sure 3
understood 3
well 3
zone 3
across 2
afraid 2
alon 2
alreadi 2
alway 2
argument 2
assign 2
awkward 2
beforehand 2
believ 2
camera 2
certain 2
chaotic 2
choos 2
clarifi 2
combin 2
come 2
compar 2
conduct 2
construct 2
contact 2
creativ 2
degre 2
doesn’t 2
done 2
effect 2
email 2
etc 2
exampl 2
express 2
facetofac 2
far 2
felt 2
focus 2
form 2
forumschat 2
freedom 2
gain 2
gener 2
hear 2
immedi 2
induc 2
inperson 2
instead 2
issu 2
join 2
kind 2
lecturerseminar 2
look 2
might 2
miss 2
note 2
order 2
passiv 2
people’ 2
platform 2
plu 2
possibl 2
rather 2
reach 2
reli 2
respond 2
say 2
schedul 2
slow 2
social 2
someon 2
task 2
teach 2
uni 2
usual 2
view 2
wait 2
workshop 2
written 2
‚put 1
23 1
3 1
50 1
abil 1
abilityknowledg 1
achiev 1
add 1
addit 1
advanc 1
afterward 1
alongsid 1
although 1
angel 1
anxiou 1
anyth 1
anytim 1
anyway 1
around 1
art 1
artifici 1
atmospher 1
attend 1
audiopressur 1
automat 1
avail 1
away 1
bad 1
barrier 1
bit 1
bore 1
bother 1
casual 1
caus 1
chatsforum 1
clarif 1
classroom 1
clear 1
closest 1
clunki 1
complet 1
complex 1
comun 1
concis 1
conect 1
confid 1
confront 1
conveni 1
correctli 1
could 1
couldn’t 1
creat 1
cross 1
crucial 1
cue 1
curat 1
daunt 1
day 1
deadlin 1
deal 1
debat 1
deeper 1
delay 1
depth 1
dicuss 1
digest 1
directli 1
easili 1
effici 1
eg 1
either 1
enabl 1
encourag 1
english 1
englishcr 1
environ 1
eventu 1
everyth 1
ex 1
exactli 1
exchang 1
exclud 1
explain 1
explor 1
extens 1
fact 1
fair 1
fake 1
famili 1
faster 1
fave 1
fill 1
fine 1
flexibl 1
flow 1
follow 1
forc 1
format 1
formul 1
forth 1
foster 1
found 1
free 1
freeli 1
friend 1
front 1
fulli 1
fun 1
furthermor 1
gap 1
goe 1
grasp 1
guidanc 1
hand 1
happen 1
hectic 1
hey 1
howev 1
ie 1
imo 1
import 1
imposs 1
inclus 1
inconveni 1
india 1
input 1
insight 1
inspir 1
instructor 1
integr 1
interactengag 1
intern 1
interrupt 1
involv 1
isn’t 1
itlong 1
jammu 1
joke 1
kashmir 1
keep 1
kept 1
lack 1
languag 1
larg 1
learner 1
learnt 1
least 1
left 1
lesson 1
life 1
littl 1
long 1
longer 1
loud 1
made 1
manner 1
mark 1
may 1
memoris 1
messag 1
messi 1
microphon 1
microsoft 1
mimic 1
mind 1
mix 1
mode 1
modul 1
month 1
moreov 1
muself 1
natur 1
never 1
nois 1
noisi 1
normal 1
nuanc 1
oblig 1
occur 1
offens 1
offer 1
oftentim 1
one 1
open 1
oppos 1
organ 1
other’ 1
otherwis 1
paddiv 1
paper 1
past 1
pay 1
perhap 1
perspect 1
phrase 1
physic 1
place 1
point 1
poor 1
practic 1
prepar 1
present 1
press 1
previou 1
privaci 1
privileg 1
process 1
procrastin 1
product 1
project 1
proper 1
prove 1
provid 1
push 1
put 1
qa’ 1
queri 1
quickli 1
quieter 1
r 1
realtim 1
reason 1
receiv 1
reflect 1
regard 1
regul 1
regular 1
relat 1
repli 1
resourc 1
restrict 1
retain 1
retyp 1
review 1
revisit 1
room 1
rote 1
routin 1
said 1
saywrit 1
school 1
screen 1
search 1
second 1
seem 1
semest 1
send 1
sens 1
sentenc 1
share 1
skill 1
skype 1
slide 1
soak 1
spark 1
speech 1
spot‘ 1
staff 1
stimul 1
store 1
stress 1
struggl 1
students’ 1
stupid 1
subject 1
submit 1
supervisor 1
switch 1
system 1
tackl 1
taught 1
team 1
teamwork 1
that’ 1
theatr 1
therefor 1
thesi 1
thing 1
third 1
thought 1
thu 1
tight 1
togeth 1
track 1
transform 1
tri 1
turn 1
tutor 1
type 1
unfreez 1
univers 1
unrequir 1
unstabl 1
unsuccess 1
valu 1
vari 1
verbal 1
veryyi 1
via 1
voic 1
w 1
wast 1
we’r 1
wed 1
weekli 1
who 1
whole 1
wifi 1
wil 1
word 1
you’ll 1
you’r 1
